In [3]:
import pandas as pd
import numpy as np
suppliers=pd.read_csv("./course-files/northwind-mongo-master/suppliers _del_1.csv",usecols=['SupplierID','CompanyName','City'])
products=pd.read_csv('./course-files/northwind-mongo-master/products_del_1.csv',usecols=['ProductID','ProductName','SupplierID'])

In [4]:
prod_and_sup=products.merge(right=suppliers, on='SupplierID', how='inner')

In [5]:
suppliers.head()

   SupplierID                         CompanyName         City
0           1                      Exotic Liquids       London
1           2          New Orleans Cajun Delights  New Orleans
2           3           Grandma Kelly's Homestead    Ann Arbor
3           4                       Tokyo Traders        Tokyo
4           5  Cooperativa de Quesos 'Las Cabras'       Oviedo

In [6]:
products.head()

   ProductID                   ProductName  SupplierID
0          1                          Chai           1
1          2                         Chang           1
2          3                 Aniseed Syrup           1
3          4  Chef Anton's Cajun Seasoning           2
4          5        Chef Anton's Gumbo Mix           2

In [7]:
prod_and_sup.head()

,ProductID,ProductName,SupplierID,CompanyName,City
0,1,Chai,1,Exotic Liquids,London
1,2,Chang,1,Exotic Liquids,London
2,3,Aniseed Syrup,1,Exotic Liquids,London
3,4,Chef Anton's Cajun Seasoning,2,New Orleans Cajun Delights,New Orleans
4,5,Chef Anton's Gumbo Mix,2,New Orleans Cajun Delights,New Orleans

In [8]:
len(suppliers)

27

In [9]:
len(products)

75

In [10]:
len(prod_and_sup)

70

In [13]:
prod_and_sup_outer=products.merge(right=suppliers, on='SupplierID', how='outer', indicator=True)
filter=prod_and_sup_outer['_merge']=='left_only'
prod_and_sup_outer[filter]

    ProductID          ProductName  SupplierID CompanyName City     _merge
27       22.0  Gustaf's Knäckebröd           9         NaN  NaN  left_only
28       23.0             Tunnbröd           9         NaN  NaN  left_only
48       36.0          Inlagd Sill          17         NaN  NaN  left_only
49       37.0           Gravad lax          17         NaN  NaN  left_only
50       73.0           Röd Kaviar          17         NaN  NaN  left_only

In [12]:
filter1=prod_and_sup_outer['_merge']=='right_only'
prod_and_sup_outer[filter1]

,ProductID,ProductName,SupplierID,CompanyName,City,_merge
75,NaN,NaN,27,Escargots Nouveaux,Montceau,right_only